<a href="https://colab.research.google.com/github/Niyati-Sinha/PYTHON-Codes-By-Niyati-Sinha/blob/master/Python%20Notebooks/Using_Numpy_Pandas_GroupBy.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **PART A**

### **Question 1**

In [258]:
import pandas as pd
import numpy as np

In [259]:
#creating data frame
df = pd.DataFrame({'A': ['group1', 'group1', 'group2', 'group1','group2', 'group1', 'group2', 'group2','group2','group1'], 'B': ['true', 'true', 'true', 'false', 'false', 'false', 'false', 'true','false','true']})

In [260]:
df

        A      B
0  group1   true
1  group1   true
2  group2   true
3  group1  false
4  group2  false
5  group1  false
6  group2  false
7  group2   true
8  group2  false
9  group1   true

In [261]:
#df['B']=df['B'].astype(int)
df.loc[df['B'] == 'false' , 'B'] = 0 #replacing false by 0
df.loc[df['B'] == 'true' , 'B'] = 1 #replacing false by 1
df

        A  B
0  group1  1
1  group1  1
2  group2  1
3  group1  0
4  group2  0
5  group1  0
6  group2  0
7  group2  1
8  group2  0
9  group1  1

In [262]:
#print groups which have true count > false count
for grouphead, restColforParticularGroup in df.groupby('A')['B']:
    freq = np.array(restColforParticularGroup)
    trueGr = (freq==1).sum() #trueGr=np.count_nonzero(freq==1)
    falseGr = (freq==0).sum()
    if trueGr> falseGr:
      print(grouphead)

group1

### **Question 2**

In [263]:
#creating pandas series
ser1 = pd.Series([1, 2, 3, 4, 5]) 
ser2 = pd.Series([4, 5, 6, 7, 8])

**a.Get the items not common to both series A and series B (Without using loops)**

In [264]:
#A unioun B - A intersection B
print(list(set(ser1).union(set(ser2))-set(ser1).intersection(set(ser2))))

[1, 2, 3, 6, 7, 8]

**b.Get the items common to both series A and series B(Without using loops)**

In [265]:
#A intersection B
print(list(set(ser1).intersection(set(ser2))))

[4, 5]

### **Question 3**

**a. Generate a random series of length 10 and find the positions of numbers that are multiples of 3 from a series?**

In [266]:
#create a dataframe of 10 random numbers ranging between 0 and 100
x=np.random.randint(100, size=(10))
df = pd.Series(x)
df

0     8
1     7
2    17
3    58
4    95
5    82
6     7
7    97
8    72
9    84
dtype: int64

In [267]:
#if number in dataframe is divisible by 3 return position
df[df%3==0].index

Int64Index([8, 9], dtype='int64')

**b. Compute the cumulative difference between the consecutive number for the same series(without using loops).**

In [268]:
s1=pd.Series([1, 3, 6, 10, 15, 21, 27, 35])
s1

0     1
1     3
2     6
3    10
4    15
5    21
6    27
7    35
dtype: int64

In [269]:
#cumulative_diff = s1.diff()
#cumulative_diff = list(cumulative_diff)
cumulative_diff = list(s1.diff())
cumulative_diff

[nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]

# **PART B Use the data (Grouby_Assignment_Data.csv)**

In [270]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [271]:
df=pd.read_csv(r'/content/drive/My Drive/Colab Datasets/Grouby_Assignment_Data.csv')
df

        Unnamed: 0  Unnamed: 0.1  ...   price quantity
0                0             0  ...  154.60       23
1                1             1  ...  299.00        1
2                2             2  ...  516.85       22
3                3             3  ...  232.90        4
4                4             4  ...   67.98        4
...            ...           ...  ...     ...      ...
109221      109221        109243  ...   59.98        8
109222      109222        109244  ...  846.32        4
109223      109223        109245  ...  239.96        4
109224      109224        109246  ...   73.05       16
109225      109225        109247  ...  109.90        5

[109226 rows x 11 columns]

### **Question 1**

**Find the Average price of project from each state**

In [272]:
#group by column school_state and giving mean of 'price' according to the groups
df.groupby('school_state')['price'].mean()

school_state
ak    337.510667
al    298.641397
ar    278.166613
az    252.355673
ca    323.282639
co    252.666940
ct    311.030415
dc    360.152267
de    234.136735
fl    297.499525
ga    308.207945
hi    365.838639
ia    284.773153
id    253.708874
il    284.538685
in    249.736221
ks    246.894763
ky    280.020031
la    358.954185
ma    328.623520
md    303.952794
me    274.640000
mi    299.793970
mn    249.289851
mo    276.094635
ms    306.512922
mt    278.000490
nc    254.037568
nd    256.985035
ne    286.515307
nh    330.994425
nj    336.891618
nm    297.836876
nv    283.005000
ny    335.973861
oh    271.301090
ok    264.163071
or    289.779098
pa    279.585613
ri    296.904035
sc    247.343586
sd    249.673433
tn    279.079419
tx    304.977799
ut    310.182139
va    267.539311
vt    289.467250
wa    283.266018
wi    301.433963
wv    258.633121
wy    307.638878
Name: price, dtype: float64

### **Question 2**

**a. Find the total number of projects previously posted by all the teachers belonging to each teacher prefix. For Example all the teachers having prefix as dr have posted a total of 13 projects combined previously.**

In [273]:
#group by column 'teacher_prefix' and giving sum of 'teacher_number_of_previously_posted_projects' according to the groups
df.groupby('teacher_prefix')['teacher_number_of_previously_posted_projects'].sum()

teacher_prefix
dr             53
mr         129516
mrs        639471
ms         441295
teacher      7671
Name: teacher_number_of_previously_posted_projects, dtype: int64

**b. Find the prefix of the teacher who has posted the maximum of projects previously**

In [274]:
#df.groupby('teacher_prefix')['teacher_number_of_previously_posted_projects'].max()
#maxPro=df['teacher_number_of_previously_posted_projects'].max()
df.loc[df['teacher_number_of_previously_posted_projects'].max(),'teacher_prefix']

'mrs'

### **Question 3**

**Find the number of projects approved for each project subject category belonging to the project grade category 'grade_9_12'**

In [275]:
df

        Unnamed: 0  Unnamed: 0.1  ...   price quantity
0                0             0  ...  154.60       23
1                1             1  ...  299.00        1
2                2             2  ...  516.85       22
3                3             3  ...  232.90        4
4                4             4  ...   67.98        4
...            ...           ...  ...     ...      ...
109221      109221        109243  ...   59.98        8
109222      109222        109244  ...  846.32        4
109223      109223        109245  ...  239.96        4
109224      109224        109246  ...   73.05       16
109225      109225        109247  ...  109.90        5

[109226 rows x 11 columns]

In [276]:
#creating a dataframe consisting of project_grade_category as 'grades_9_12'
df3=df[df.project_grade_category == 'grades_9_12']
df3

        Unnamed: 0  Unnamed: 0.1  ...   price quantity
22              22            22  ...  278.09       21
28              28            28  ...  129.98        3
39              39            39  ...   49.99       25
63              63            63  ...   75.54       62
73              73            73  ...  142.84       13
...            ...           ...  ...     ...      ...
109116      109116        109138  ...  197.99       10
109142      109142        109164  ...  401.57        9
109172      109172        109194  ...  117.64        3
109208      109208        109230  ...  309.60        4
109209      109209        109231  ...  155.70        5

[10960 rows x 11 columns]

In [277]:
#grouping data according to 'project_subject_categories' and counting for 'project_is_approved' in these groups
df3=df3.groupby('project_subject_categories')['project_is_approved'].count()
df3

project_subject_categories
appliedlearning                        494
appliedlearning_health_sports           43
appliedlearning_history_civics          72
appliedlearning_literacy_language      219
appliedlearning_math_science           171
appliedlearning_music_arts             175
appliedlearning_specialneeds           124
appliedlearning_warmth_care_hunger       1
health_sports                         1137
health_sports_appliedlearning            7
health_sports_history_civics             9
health_sports_literacy_language         12
health_sports_math_science              10
health_sports_music_arts                22
health_sports_specialneeds              67
health_sports_warmth_care_hunger         2
history_civics                         531
history_civics_appliedlearning          11
history_civics_health_sports             6
history_civics_literacy_language       104
history_civics_math_science             20
history_civics_music_arts               60
history_civics_specialneeds             65
literacy_language                     2030
literacy_language_appliedlearning       26
literacy_language_health_sports          9
literacy_language_history_civics        61
literacy_language_math_science          85
literacy_language_music_arts           189
literacy_language_specialneeds         256
math_science                          2408
math_science_appliedlearning           174
math_science_health_sports              62
math_science_history_civics             39
math_science_literacy_language          76
math_science_music_arts                176
math_science_specialneeds              208
math_science_warmth_care_hunger          2
music_arts                            1125
music_arts_appliedlearning               1
music_arts_health_sports                 6
music_arts_history_civics                1
music_arts_specialneeds                 19
specialneeds                           390
specialneeds_health_sports              18
specialneeds_music_arts                 49
specialneeds_warmth_care_hunger          5
warmth_care_hunger                     183
Name: project_is_approved, dtype: int64

### **Question 4**

**Replace teacher_prefix with the average number of approved projects for each teacher prefix**

In [278]:
#creating a data frame grouped by 'teacher_prefix' and calculating the mean of 'teacher_prefix' in these groups
df4=df.groupby('teacher_prefix')['project_is_approved'].mean()

#converting dataframe to dictionary
df4=dict(df4)

df4

{'dr': 0.6923076923076923,
 'mr': 0.8415218412400188,
 'mrs': 0.8555462419670299,
 'ms': 0.8435188989317995,
 'teacher': 0.7953389830508475}

In [279]:
#replacing 'teacher_refix' by the mean calculated in the above dataframe
df['teacher_prefix']=df["teacher_prefix"].apply(lambda x : df4[x])

In [280]:
df

        Unnamed: 0  Unnamed: 0.1  ...   price  quantity
0                0             0  ...  154.60        23
1                1             1  ...  299.00         1
2                2             2  ...  516.85        22
3                3             3  ...  232.90         4
4                4             4  ...   67.98         4
...            ...           ...  ...     ...       ...
109221      109221        109243  ...   59.98         8
109222      109222        109244  ...  846.32         4
109223      109223        109245  ...  239.96         4
109224      109224        109246  ...   73.05        16
109225      109225        109247  ...  109.90         5

[109226 rows x 11 columns]

### **Question 5**

**Find the desired output as shown in the image below. Note : Create the data frame (Train Data) as shown in the image below (Output can be in fraction form or decimal form )
Note: image is available in the questions pdf**

In [281]:
#creating dictionary
dictionary = {"State" : ["A", "B", "C", "A", "A", "B", "A", "A", "C", "C"],
        "Class" : [0, 1, 1, 0, 1, 1, 0, 1, 1, 0]
       }
dictionary

{'Class': [0, 1, 1, 0, 1, 1, 0, 1, 1, 0],
 'State': ['A', 'B', 'C', 'A', 'A', 'B', 'A', 'A', 'C', 'C']}

In [282]:
#convert dictionary to DataFrame
df5 = pd.DataFrame(dictionary)
df5

  State  Class
0     A      0
1     B      1
2     C      1
3     A      0
4     A      1
5     B      1
6     A      0
7     A      1
8     C      1
9     C      0

In [283]:
#no. of Class=1 for each state 
totalClass1 = dict(df5.groupby("State")["Class"].sum()) #sum will return for state=1 as for state=0 only 0 will be added
totalClass1

{'A': 2, 'B': 2, 'C': 2}

In [284]:
#no. of Classes for each state
totalClass = dict(df5.groupby("State")["Class"].count())
totalClass

{'A': 5, 'B': 2, 'C': 3}

In [285]:
#no. of Class=0 for each state
totalClass0 = dict(df5.groupby("State")["Class"].count()-df5.groupby("State")["Class"].sum())
totalClass0

{'A': 3, 'B': 0, 'C': 1}

In [286]:
#making a dictionary by combining values of dictionary totalClass0, totalClass1 according to keys
combinedDict={}
di=[totalClass0, totalClass1]
for key in totalClass0.keys():
  combinedDict[key]=list(combinedDict[key] for combinedDict in di)

combinedDict

{'A': [3, 2], 'B': [0, 2], 'C': [1, 2]}

In [287]:
#Converting the dictionary combinedDict to dataframe and naming the dataframe index as State and columns as Class=0 , Class=1
df7 = pd.DataFrame.from_dict(combinedDict,orient='index',columns=['Class = 0','Class = 1'])
#df7.index.name='STATE'
df7.index.rename("STATE",inplace=True)
df7

       Class = 0  Class = 1
STATE
A              3          2
B              0          2
C              1          2

In [288]:
df5

  State  Class
0     A      0
1     B      1
2     C      1
3     A      0
4     A      1
5     B      1
6     A      0
7     A      1
8     C      1
9     C      0

In [289]:
#creating the final DataFrame
df5["State 0"] = df5["State"].apply(lambda x : str(totalClass0[x]) + "/" + str(totalClass[x]))
df5["State 1"] = df5["State"].apply(lambda x : str(totalClass1[x]) + "/" + str(totalClass[x]))

df5

  State  Class State 0 State 1
0     A      0     3/5     2/5
1     B      1     0/2     2/2
2     C      1     1/3     2/3
3     A      0     3/5     2/5
4     A      1     3/5     2/5
5     B      1     0/2     2/2
6     A      0     3/5     2/5
7     A      1     3/5     2/5
8     C      1     1/3     2/3
9     C      0     1/3     2/3